---
kind: method
id: M:Autodesk.Revit.DB.DisplacementElement.GetChildren
source: html/d7e84ab1-d970-b926-eea8-00032962431a.htm
---
# Autodesk.Revit.DB.DisplacementElement.GetChildren Method

Returns a set of DisplacementElements which have this
 DisplacementElement as a parent.

## Syntax (C#)
```csharp
public IList<DisplacementElement> GetChildren()
```

## Returns
The returned array is sorted by element id.